abstra_notas/nfse/ce/fortaleza/templates/EnvioRPS.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:ns="http://www.fortaleza.ce.gov.br/iss">
    <soap:Header/>
    <soap:Body>
        <ns:RecepcionarLoteRps>
            <ns:LoteRps>
                <ns:NumeroLote>1</ns:NumeroLote>
                <ns:Cnpj>{{ remetente if remetente_tipo == '2' else '' }}</ns:Cnpj>
                {% if remetente_tipo == '1' %}
                <ns:Cpf>{{ remetente }}</ns:Cpf>
                {% endif %}
                <ns:InscricaoMunicipal></ns:InscricaoMunicipal>
                <ns:QuantidadeRps>1</ns:QuantidadeRps>
                <ns:ListaRps>
                    {{ rps | safe }}
                </ns:ListaRps>
            </ns:LoteRps>
        </ns:RecepcionarLoteRps>
    </soap:Body>
</soap:Envelope>
